// pages/book/book.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    bookInfo:{
      coverUrl:"/images/kris8.jpeg",
      title:"Like That",
      author:"kris"
    },
    pages:[
      {
        text: "页面管理框架 管理了整个小程序的页面路由，可以做到页面间的无缝切换，并给以页面完整的生命周期。开发者需要做的只是将页面的数据，方法，生命周期函数注册进 框架 中，其他的一切复杂的操作都交由 框架 处理。 基础组件框架                   提供了一套基础的组件，这些组件自带微信风格的样式以及特殊的逻辑，开发者可以通过组合基础组件，创建出强大的微信小程序 。丰富的 API框架 提供丰富的微信原生 API，可以方便的调起微信提供的能力，如获取用户信息，本地存储，支付功能等。2014年5月15日，吴亦凡正式向首尔中央地方法院提出请求判决与SM娱乐公司《专属合同》无效 [29-30]  。6月，拍摄个人首部电影《有一个地方只有我们知道》，在片中饰演大提琴手单亲爸爸彭泽阳 [10]  [31]  [32]  。7月17日，为《小时代3：刺金时代》演唱片尾曲《时间煮雨》 [7]  [33-34]  。8月，确定出演《夏有乔木》男主角夏木 [35-36]  。9月11日，《有一个地方只有我们知道》在北京举行的关机发布会上，为其演唱插曲"
      },
      {
        text: "页面管理框架 管理了整个小程序的页面路由，可以做到页面间的无缝切换，并给以页面完整的生命周期。开发者需要做的只是将页面的数据，方法，生命周期函数注册进 框架 中，其他的一切复杂的操作都交由 框架 处理。 基础组件框架                   提供了一套基础的组件，这些组件自带微信风格的样式以及特殊的逻辑，开发者可以通过组合基础组件，创建出强大的微信小程序 。丰富的 API框架 提供丰富的微信原生 API，可以方便的调起微信提供的能力，如获取用户信息，本地存储，支付功能等。2014年5月15日，吴亦凡正式向首尔中央地方法院提出请求判决与SM娱乐公司《专属合同》无效 [29-30]  。6月，拍摄个人首部电影《有一个地方只有我们知道》，在片中饰演大提琴手单亲爸爸彭泽阳 [10]  [31]  [32]  。7月17日，为《小时代3：刺金时代》演唱片尾曲《时间煮雨》 [7]  [33-34]  。8月，确定出演《夏有乔木》男主角夏木 [35-36]  。9月11日，《有一个地方只有我们知道》在北京举行的关机发布会上，为其演唱插曲"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})